Repository: 84000/translation-memory-resources
Catalog: post_input/toh94-C.bo.en.tmx
Source language: bo
Languages: en

source: བདེ་གཤེགས་ འོད་ དཔག་མེད་པ་ གླ་མི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ འི་ འོད་ དེ་ ལ །_། གདུགས་ གཅིག་ཅིག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $61 “The well-gone Amitābha, when a hired laborer, |#| Offered a single parasol |#| To the thus-gone Array of Light |#| And in doing so first gave rise to the mind of awakening. [291.a]

source: དེ་བཞིན་ [291a] གཤེགས་པ་ ཀླུ་ སྦྱིན་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ་ རྣམ་ བསྒྱིངས་ ལ །_། མེ་ཏོག་ དག་ གི་ ཆུན་པོ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $62 “The thus-gone Nāgadatta, when a garland maker, |#| Offered a wreath of flowers |#| To the thus-gone Striding Lion |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བརྟན་ གཤེགས་ ནོར་བུ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་གཉིས་ སྤོང་ དེ་ ལ །_། རིན་པོ་ཆེ་ ཡི་ དྲ་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $63 “The well-gone Dṛḍhakrama, when a jeweler, |#| Offered a jewel net |#| To the thus-gone Abandoning Doubt |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ཡོད་ མཐོང་བ་ ནད་པ འི་ གསོས་ སྨན་ ལ །_། སྦྱོར་ མཁན་ བུར་ གྱུར་ ཚེ་ ན་ དགེ་སློང་ དགེ་འདུན་ དག _། |#| སྤྱན་ དྲངས་ ནད་ སྨན་ སྦྱར་ ནས་ བདེ་གཤེགས་ ལེགས་ མཐོང་ ལ །_། དང་པོ་ ཁོ་ན ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $64 “The well-gone Amoghadarśin, when the son of a medicine maker, |#| Invited the saṅgha of monks and provided medicine |#| To the well-gone Excellent Sight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བརྩོན་འགྲུས་ སྦྱིན་པ་ འཁོར་ལོ ས་ སྒྱུར་ རྒྱལ་ ཚེ །_། ཙན་དན་ དམར་པོ་ དག་ ལས་ གཙུག་ལག་ཁང་ བརྒྱ་ སྟོང་ །_། བྱས་ ཏེ་ |#| རས་ བཅོས་ གཡོགས་ ནས་ |#| དེ་བཞིན་ གཤེགས་པ་པོ །_། བདུད་རྩི འི་ སྟབས་ ལ་ དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $65 “The well-gone Vīryadatta, when a universal monarch, |#| Built one hundred thousand temples of red sandalwood |#| And covered them with fine cloth before the thus-gone Nectar Strength |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བཟང་སྐྱོང་ གིས་ ནི་ བདེ་གཤེགས་ ཟླ་བ འི་ འོད །_། ཉན་ཐོས་ བཅས་པ འི་ དགེ་འདུན་ འཁོར་བཅས་ ཁྲི་ཕྲག་ བཅུ །_། ཞག་ བདུན་ བར་ དུ་ ཞལ་ཟས་ རོ་ ནི་ བརྒྱ་ ལྡན་པ ས །_། ཚིམ་པ ར་ མཛད་ དེ་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $66 “The well-gone Bhadrapāla |#| Invited the well-gone Moonlight along with one hundred thousand of his saṅgha of hearers, |#| Offering them satisfying food endowed with a hundred tastes for seven days, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དགའ་བོ་ རྩལ་ ཆེན་ བྲམ་ཟེ འི་ བུར །_། གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ མཆོག་ གྲགས་ ལ །_། ཡུ་བ་ ནོར་བུས་ སྤྲས་པ འི་ རྔ་ཡབ་ གཅིག _། ཕུལ་ ནས་ དང་པོ ར་ བྱང་ཆུབ་ སེམས་བསྐྱེད་ དོ །_།
en: $67 “The well-gone Nanda, when the son of a brahmin endowed with great power, |#| Offered a yak-tail fan with a jewel-studded handle |#| To the thus-gone Supreme Fame |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ འཆི་མེད་ རྒྱལ་པོ་ ཡི །_། ཕོ་ཉ ར་ གྱུར་ ཚེ་ བདེ་གཤེགས་ དབང་ སྦས་ ལ །_། པན་ ཙ་ ལི་ ཡི་ འབྲས་བུ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $68 “The thus-gone Acyuta, when a royal messenger, |#| Offered fruit from Pāñcālī#160 |#| To the well-gone Hidden Faculty |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་གེ འི་ རྒྱལ་མཚན་ ཞིང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ང་རོ་ གསལ་ དེ་ ལ །_། སྐྱུ་རུ་ར་ ཡི་ འབྲས་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $69 “The well-gone Siṃhadhvaja, when a farmer, |#| Offered myrobalan fruit |#| To the thus-gone Clear Roar |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྒྱལ་བ་ ཚལ་ གྱི་ ལས་ བྱེད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཐོགས་མེད་ འཁོར་ལོ་ ལ །_། ཨ་རུ་ ར་ ཡི་ འབྲས་བུ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $70 “The well-gone Jaya, when a garden worker, |#| Offered harītakī fruit |#| To the thus-gone Unimpeded Wheel |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཆོས་ལྡན་ དཔའ་བོ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ ང་རོ་ ལ །_། རྒྱལ་ [291b] མཚན་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $71 “The thus-gone Dhārmika, when a hero, |#| Offered banners [291.b] |#| To the thus-gone Nectar Roar |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཆོག་དགའ་ རྒྱལ་པོ་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ མཆོད་རྟེན་ ལ །_། ཕྱེ་མ་ སྤར་གང་ ཕུལ་ ཏེ་ གཏོར་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $72 “The well-gone Prāmodyarāja, when an incense merchant, |#| Offered and sprinkled handfuls of incense powder |#| Before the thus-gone Stūpa of Wisdom |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཁ་ལོ་ སྒྱུར་བ་ བྱིས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ རྫུ་འཕྲུལ་ ལ །_། པ་ ལ་བ་ ཏ་ གསུམ་ ཞིག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $73 “The well-gone Sārathi, when a young child, |#| Offered three palabata#161 |#| To the thus-gone Miraculous Display of Splendor |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དགའ་ གཤེགས་ རྒྱལ་པོ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ རྒྱལ་པོ་ ལ །_། དངུལ་ གྱི་ མེ་ཏོག་ དག་ ནི་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $74 “The well-gone Priyaṅgama, when a prince, |#| Offered silver flowers |#| To the thus-gone King of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཆུ་ལྷ་ ཚོང་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཁ་དོག་ དཔག་མེད་ ལ །_། ལྷུང་བཟེད་ སྦྲང་རྩི ས་ བཀང་ སྟེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $75 “The thus-gone Varuṇa, when a merchant, |#| Offered an alms bowl filled with honey |#| To the thus-gone Infinite Colors |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡོན་ཏན་ ལག་ ནི་ རྩེ་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྟོབས་ཆེན་ དེ་ ལ་ ནི །_། འཆག་ས་ ཁྲུ་ བརྒྱད་ ཁོར་ཡུག་ བཀྲམ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $76 “The well-gone Guṇabāhu, at the time of play, |#| Constructed a monastic walkway with a perimeter wall eight cubits long |#| For the thus-gone Great Strength |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤོས་ གླང་ སྤོས་ འཚོང་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བཀོད་པ་ རྣམ་གྲོལ་ གྱི །_། འཆག་ས་ སྤོས་ ཀྱི་ ཆུ་ ཡིས་ ཆག་ཆག་ བཏབ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $77 “The well-gone Gandhahastin, when the son of an incense merchant, |#| Sprinkled a monastic walkway with fragrant water |#| For the thus-gone Array of Liberation |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་ གཟིགས་ གོས་ འཚོང་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟིགས་པ་ སྒྲིབ་ མེད་ ལ །_། མེ་ཏོག་ གི་ ནི་ གདུགས་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $78 “The well-gone Vilocana, when a garment merchant, |#| Offered flower parasols |#| To the thus-gone Unobscured Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འབྲུག་སྒྲ་ རྫ་མཁན་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སེང་གེ འི་ སྟབས་ དེ་ ལ །_། སྤོས་ དང་ རིལ་བ་ གཅིག་ཅིག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $79 “The well-gone Meghasvara, when a potter, |#| Offered fragrances and a water pot |#| To the thus-gone Lion Gait |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལེགས་ སེམས་ ཁྱེའུ་ ལོ་ གསུམ་ ལོན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཀུན་ ཏུ་ རྣམ་ གཟིགས་ ལ །_། པད་མ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $80 “The well-gone Sucintita, when three years old, |#| Offered lotus flowers |#| To the thus-gone Universal Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡིད་བཟང་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རྩལ་ སྦྱིན་ དེ་ ལ་ ནི །_། སྣ་མ འི་ མེ་ཏོག་ཕྲེང་བ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ [292a] དོ །_།
en: $81 “The well-gone Sumanas, when the son of a merchant, |#| Offered a garland of sumanā flowers |#| To the thus-gone Energy Gift |#| And in doing so first gave rise to the mind of awakening. [292.a]

source: བདེ་གཤེགས་ དྲི་མེད་ ཐ་ག་པ ར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལེགས་ མཐོང་ དེ་ ལ་ ནི །_། འབའ་ཤ་ ཀ་ གཅིག་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $82 “The well-gone Vimala, when a weaver, |#| Offered a woolen robe#162 |#| To the thus-gone Excellent Sight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཟླ་བ་ གླང་ཆེན་ འདུལ་བ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟུགས་བཟང་ དེ་ ལ་ ནི །_། མེ་ཏོག་ཕྲེང་བ་ ཁྲུ་ གང་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $83 “The well-gone Śaśin, when an elephant tamer, |#| Offered a cubit of flower garlands |#| To the thus-gone Excellent Form |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གྲགས་ཆེན་ གྲོང་ཁྱེར་ རྟེན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བློ་གྲོས་ གྲགས་ དེ་ ལ །_། མེ་ཏོག་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $84 “The well-gone Mahāyaśas, when a city beggar, |#| Offered flowers |#| To the thus-gone Famed Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ གཙུག་ ན་ ནོར་བུ་ ཁྱེའུ་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ བཀོད་ དེ་ ལ །_། ས་རྡུལ་ སྤར་གང་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $85 “The well-gone Maṇicūḍa, when a boy, |#| Offered a handful of earth |#| To the thus-gone Jewel Array |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ དྲག་ཤུལ་ ལྷ འི་ བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྤ་བ འི་ འོད་ དེ་ ལ །_། ལྷ་ ཡི་ གཞལ་མེད་ ཁང་ གཅིག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $86 “The thus-gone Ugra, when a divine son, |#| Offered a divine palace |#| To the thus-gone Majestic Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སེང་ སྟབས་ གདུགས་ མཁན་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཐར་པ ར་ བཞུད་ དེ་ ལ །_། ཚ་བ འི་ དུས་ ཚེ་ལོ་ མ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $87 “The well-gone Siṃhagati, when a parasol maker, |#| Offered a leaf parasol during the hot season |#| To the thus-gone Gone to Liberation |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ལྗོན་པ་ ཕྱུགས་རྫི འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ བཀོད་ དེ་ ལ །_། ལམ་ གྱི་ ཤིང་ དྲུང་ དག་ ཏུ་ བེའུ་རས་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $88 “The thus-gone Druma, when a herdsman, |#| Offered fine linen at trees by the roadside |#| To the thus-gone Array of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་རྒྱལ་ བ་ལང་ རྫི་ ཡི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ངེས་པ འི་ བློ་ དེ་ ལ །_། ལྷུང་བཟེད་ འོ་མ ས་ བཀང་ སྟེ་ |#| ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $89 “The well-gone Vijitāvin, when a cowherd, |#| Offered an alms bowl filled with milk |#| To the thus-gone Mind of Certainty |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཤེས་རབ་ བརྩེགས་པ་ དགེ་སློང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཏོག་ དེ་ ལ །_། ཉིན་ གཅིག་ རངས་པ ར་ ཆོས་ ཀྱི་ གདན་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $90 “The well-gone Prajñākūṭa, when a monk, |#| Offered a Dharma seat to be used for a day |#| To the thus-gone Crest of Wisdom |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལེགས་ གནས་ ལྷམ་ མཁན་ གྱུར་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མི་ གཡོ འི་ བློ་ དེ་ ལ །_། མཆིལ་ལྷམ་ རིམ་པ་ གཅིག་པ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $91 “The well-gone Susthita, when a shoemaker, |#| Offered shoes with one lining#163 |#| To the thus-gone Immutable Mind |#| And in doing so first gave rise to the mind of awakening. [292.b]

source: དེ་བཞིན་ གཤེགས་ [292b] པ་ བློ་གྲོས་ ལས་ བྱེད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྤྱོད་པ འི་ བློ་གྲོས་ ལ །_། རོ་ དང་ ལྡན་པ འི་ བཏུང་བ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $92 “The thus-gone Mati, when a worker, |#| Offered tasty drink |#| To the thus-gone Intelligence in Practice |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཡན་ལག་ སྐྱེས་ ནི་ མི་ འཛིན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟུགས་བཟང་ དེ་ ལ་ ནི །_། ཁྲུས་རས་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $93 “The well-gone Aṅgaja, when a jailer,#164 |#| Offered bathing cloths |#| To the thus-gone Excellent Form |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བློ་ མཐའ་ཡས་པ་ ནི །_། ལམ་ སྟོན་ གྱུར་ ཚེ་ བདེ་གཤེགས་ བདེན་ སྨྲ་ ལ །_། ཤིང་ དྲུང་གནས་ མལ་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $94 “The thus-gone Amitabuddhi, when a guide, |#| Offered a bed at the foot of a tree |#| To the well-gone Truth Speaker |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ གཟུགས་བཟང་ སྡེ་དཔོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྐད་ དབྱངས་ དེ་ ལ་ ནི །_། མེ་ཏོག་ ཨུད་ པལ་ ལྔ་ ཞིག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $95 “The thus-gone Surūpa, when a general, |#| Offered five utpalas |#| To the thus-gone Melodious Voice |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ མཁྱེན་ལྡན་ དགོན་གནས་ དགེ་སློང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ལེགས་པ ར་ མཐོང་ དེ་ ཡི །_། འཆག་ས་ བྱི་དོར་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $96 “The well-gone Jñānin, when a monk living in solitude, |#| Offered a well-swept monastic walkway |#| To the thus-gone Excellent Sight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ འོད་ཟེར་ ཤིང་རྟ་ མཁན་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གཟི་བརྗིད་ མཐའ་ ཡས་ལ །_། ཉལ་ཁྲི་ སྟོང་ རི་བ་ དག་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $97 “The well-gone Raśmi, when a chariot maker, |#| Offered a bed worth one thousand |#| To the thus-gone Infinite Splendor |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བརྟུལ་ཞུགས་ བརྟན་པ་ ནི །_། ཕྲེང་རྒྱུད་ མཁན་ ཚེ་ བདེ་གཤེགས་ ཡིད་འོང་ སེམས །_། དེ་ ལ་ མེ་ཏོག་ བླ་རེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $98 “The thus-gone Dṛḍhavrata, when a garland maker, |#| Offered a canopy of flowers |#| To the well-gone Delightful Mind |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བཀྲ་ཤིས་ ཤིང་ ཐུན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གྲགས་པ འི་ ཤིང་རྟ་ ལ །_། བུ་ཡུག་ ལངས་ ཚེ་ སྣང་ མ་ བལྟམ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $99 “The thus-gone Maṅgala, when a wood gatherer, |#| Offered service during a snowstorm |#| To the thus-gone Famed Chariot |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ བདེན་ ཏོག་ ཁྲུས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ མེ་ཏོག་ ལ །_། ཁ་ གདོང་ བཀྲུ་བ་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $100 “The thus-gone Satyaketu, when a bath attendant, |#| Washed the face |#| Of the thus-gone Flower of Qualities |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ པད་མ་ ཚོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ འོད་ཟེར་ ལ །_། པད་མ་ དག་ ནི་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $101 “The well-gone Padma, when the son of a merchant, |#| Offered lotus flowers |#| To the thus-gone Radiant Flowers |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ སྲེད་ མེད་ བུ་ ནི་ སྤོས་ འཚོང་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གདུལ་བ ར་ དཀའ་ ཞེས་ བྱ་བ་ དེ འི །_། ཁང་པ་ བརྩེགས་ [293a] པ་ ཙན་དན་ དམར་པོ ས་ བྱུགས་ ནས་ |#| ཀྱང་ །_། དང་པོ་ ཁོ་ན ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $102 “The thus-gone Nārāyaṇa, when an incense merchant, |#| Offered a multistoried mansion rubbed in red sandalwood [293.a] |#| To the thus-gone Hard to Subdue |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ལག་ བཟངས་ རྒྱལ་པོ འི་ ཕོ་ཉ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དབྱངས་སྙན་ སྒྲོགས་ པར་ མཛད་པ་ གང་ །_། འཁོར་བཅས་ བྱེ་བ་ དག་ ལ་ ཆོས་གོས་ གསུམ་ ཕུལ་ ནས །_། |#| དང་པོ་ ཁོ་ན ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $103 “The thus-gone Subāhu, when a royal messenger, |#| Offered the three Dharma robes |#| To the thus-gone Speaker with Beautiful Voice and his ten millionfold following, |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འབྱུང་གནས་ ནི །_། ཚན་པོ་ ཆེ ར་ གྱུར་ གཡུལ་ངོ ར་ ཆས་པ འི་ ཚེ །_། བདེ་གཤེགས་ ལེགས་ མཐོང་ ལ་ ནི་ རྒྱལ་མཚན་ གཅིག _། ཕུལ་ ནས་ |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $104 “The thus-gone Jñānākara, when a champion about to enter the battlefield, |#| Offered a banner |#| To the well-gone Excellent Sight |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ འོད་འཕྲོ་ སྨན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྐྱེ་བོ འི་ མཆོད་རྟེན་ ལ །_། སྤོས་ ཀྱི་ རེང་བུ་ དག་ ནི་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $105 “The thus-gone Arciṣmat, when a physician, |#| Offered incense sticks |#| To the thus-gone Stūpa for Humanity |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཚངས་ བྱིན་ ལམ་ སྟོན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ འོད་ ཆེན་ ཞེས་ བྱ་བ །_། དེ་ ལ་ ལམ་ དག་ མཚོན་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $106 “The thus-gone Brahmadatta, when a guide, |#| Showed the way |#| To the thus-gone Great Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ འབྱུང་གནས་ མཉན་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བརྫི་བ་ མེད་ གཤེགས་ དེ །_། |#| ཉན་ཐོས་ འཁོར་བཅས་ བྱེ་བ་ བསྒྲལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $107 “The well-gone Ratnākara, when a ferryman, |#| Ferried the thus-gone Indestructible Departure |#| And his retinue of ten million hearers, |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ལྷ་ ཡི་ མེ་ཏོག་ ནོར་བུ་ མཁན །_། གྱུར་ ཚེ་ དེ་བཞིན་ གཤེགས་པ་ བློ་གསལ་ ལ །_། ནོར་བུ་ རིན་ཆེན་ སྤྲས་པ འི་ གདུགས་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $108 “The well-gone Kusumadeva, when a jeweler, |#| Offered a parasol studded with precious jewels |#| To the thus-gone Clear Intelligence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ དོན་ ལེགས་ སེམས་པ་ རྒྱལ་བུ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ གསུང་སྙན་ དེ་ ལ་ ནི །_། ནོར་བུ་ རིན་ཆེན་ སྤྲས་པ འི་ བླ་རེ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $109 “The well-gone Sucintitārtha, when a prince, |#| Offered a canopy studded with precious jewels |#| To the thus-gone Melodious Voice |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཆོས་ ཀྱི་ དབང་ཕྱུག་ ཤིང་ མཁན་ གྱི །_། བུར་ གྱུར་ ཚེ་ ན་ བདེ་གཤེགས་ སྐར་འོད་ ཀྱི །_། གཤེགས་ ཟམ་ དག་ ནི་ བཤམ་པ་ བྱས་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $110 “The well-gone Dharmeśvara, when the son of a carpenter, |#| Constructed a bridge |#| For the well-gone Starlight |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ བློ་ གྲགས་ ཀུན་དགའ་ ར་ སྲུངས་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ འི་ སྒྲོན་ དེ་ ལ །_། མོན་སྲན་ གྲེའུ་ ཡི་ མེ་ཏོག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $111 “The well-gone Yaśomati, when a garden guard, |#| Offered māṣa flowers |#| To the thus-gone Moon Lamp |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྤོབས་ བརྩེགས་ ཚོང་པ འི་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཏོག་ དེ་ [293b] ལ །_། སྦྱིན་པ་ ཕུན་སུམ་ ཚོགས་པ ས་ སྤྱན་ དྲངས་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $112 “The well-gone Pratibhānakūṭa, when the son of a merchant, |#| Offered welcome and perfect generosity [293.b] |#| To the thus-gone Wisdom Crest |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ རྡོ་རྗེ འི་ རྒྱལ་མཚན་ ནི །_། ཚལ་ གྱི་ ལས་ བྱེད་ ཚེ་ ན་ དེ་བཞིན་ གཤེགས །_། |#| བསོད་ནམས་ བཀོད་ དེ་ ལ་ ནི་ ཨ་མྲ་ ཕུལ །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $113 “The thus-gone Vajradhvaja, when a garden worker, |#| Offered mango fruit |#| To the thus-gone Merit Array |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ ཕན་ བཞེད་ གྲོང་དཔོན་ བུར་ གྱུར་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ བསོད་ནམས་ འོད་ ཅེས་བྱ་བ་ ལས །_། ཉིན་ གཅིག་ སྲོག་གཅོད་ སྤོང་བ འི་ བསླབ་གཞི་ མནོས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $114 “The thus-gone Hitaiṣin, when the son of the leader of a city, |#| Received the vow of refraining from killing for one day |#| From the thus-gone Light of Merit |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རྣམ་ རོལ་ གྲོང་རྡལ་ བྱིས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འབྱུང་གནས་ ལ །_། ལྷུང་བཟེད་ སྦྲང་རྩི ས་ བཀང་ སྟེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $115 “The well-gone Vikrīḍitāvin, when a child in a village, |#| Offered an alms bowl filled with honey |#| To the thus-gone Source of Wisdom |#| And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་ གཤེགས་པ་ མུན་ དང་ བྲལ་བ་ ཡིས །_། དེ་བཞིན་ གཤེགས་པ་ སྲིད་མཐའ་ གཟིགས་ དེ་ ལ །_། མོན་སྲན་ གྲེའུ་ འབྲུ་མར་ མེ་ བཞག་ ཕུལ་ ནས །_། |#| དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $116 “The thus-gone Vigatatamas |#| Presented a lamp filled with māṣa bean oil |#| To the thus-gone Seeing the Ends of Existence |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ སྒྲ་གཅན་ ལྷ་ ནི་ གྲོང་ རྟེན་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ དགའ་བ ར་ གཟིགས་ དེ་ |#| ལ །_། ཧ་ སྟ་ བ་ཤ་ཀ་ དག་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $117 “The well-gone Rāhudeva, when a city beggar, |#| Offered hastabashaka#165 |#| To the thus-gone Joyous Vision |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རི་བོ འི་ རྒྱལ་མཚན་ ཚོགས་ ལྡན་ གྱི །_། ཁྱེའུ ར་ གྱུར་ ཚེ་ བདེ་གཤེགས་ མཐའ་ ཡ ས་ འོད །_། དེ་ ལ་ མེ་ཏོག་ ཆུན་པོ་ ཕུལ་ ནས་ |#| ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $118 “The well-gone Merudhvaja, when a young leader of a group, |#| Offered a garland of flowers |#| To the well-gone Infinite Light |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ ཚོགས་ཅན་ འོད་ ནི་ ཕྲེང་རྒྱུད་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ ཡིད་འོང་ དབྱངས་ དེ་ ལ །_། མེ་ཏོག་ ལས་ བྱས་ བླ་རེ་ ཕུལ་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $119 “The well-gone Gaṇiprabha, when a garland maker, |#| Offered a flower canopy |#| To the thus-gone Compelling Melody |#| And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ རིན་ཆེན་ སྙིང་པོ་ ཁྲུས་པ འི་ ཚེ །_། དེ་བཞིན་ གཤེགས་པ་ སྣ་ཚོགས་ གསུང་བ་ ལ །_། ཁ་ གདོང་ བཀྲུ་བ་ དབུལ་བ་ བྱས་ ནས་ ཀྱང་ །_། དང་པོ ར་ བྱང་ཆུབ་ ཏུ་ ནི་ སེམས་བསྐྱེད་ དོ །_།
en: $120 “The well-gone Ratnagarbha, when a bath attendant, |#| Washed the face |#| Of the thus-gone Diverse Teaching |#| And in doing so first gave rise to the mind of awakening.
